import matplotlib.pyplot as plt

# Определение координат для надписи "Dart Vader"
dart_vader_points = {
    'D': [(1, 3), (1, 2), (1, 1), (2, 3), (2, 1), (3, 3), (3, 1), (4, 2)],
    'a': [(6, 2), (7, 1), (8, 2), (6, 3), (8, 3)],
    'r': [(10, 3), (10, 2), (10, 1), (11, 1)],
    't': [(14, 3), (14, 2), (14, 1), (13, 1), (15, 1)],
    'V': [(17, 1), (18, 2), (19, 3), (20, 2), (21, 1)],
    'a2': [(23, 2), (24, 1), (25, 2), (23, 3), (25, 3)],
    'd': [(27, 3), (27, 2), (27, 1), (28, 3), (28, 1), (29, 3), (29, 1), (30, 2)],
    'e': [(32, 1), (32, 2), (32, 3), (33, 1), (33, 3)],
    'r2': [(35, 3), (35, 2), (35, 1), (36, 1)],
}

# создаём новую фигуру и добавляем к ней набор осей(ax)
fig, ax = plt.subplots()

# Рисуем каждую точку
for letter, points in dart_vader_points.items():
    for point in points:
        ax.plot(*point, 'bo')

# Задаем параметры изображения (границы по x, y)
ax.set_ylim(0, 4)
ax.set_xlim(0, 37)
# устанавливаем одинаковое соотношение масштаба точек
ax.set_aspect('equal')

# инвертируем ось Y
plt.gca().invert_yaxis()
# показываем график
plt.show()

# my name
maksim_points = {
    'M': [(1, 1), (1, 2), (1, 3), (2, 2), (3, 3), (3, 2), (3, 1)],
    'a': [(5, 3), (5, 2), (6, 1), (7, 2), (7, 3)],
    'k': [(9, 1), (9, 2), (9, 3), (10, 2), (11, 1), (11, 3)],
    's': [(13, 1), (13, 2), (14, 1), (14, 3), (15, 2), (15, 3)],
    'i': [(17, 1), (17, 3)],
    'm': [(19, 3), (19, 2), (20, 1), (21, 2), (21, 3), (22, 1), (23, 2), (23, 3)]
}

fig, ax = plt.subplots()

for letter, points in maksim_points.items():
    for point in points:
        ax.plot(*point, 'bo')

ax.set_ylim(0, 4)
ax.set_xlim(0, 24)
ax.set_aspect('equal')
plt.gca().invert_yaxis()
plt.show()